Autodesk.Revit.DB.Revision.CombineWithNext(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Combines the specified Revision with the next Revision.
Remarks:
All RevisionClouds and tags associated with the specified Revision will be reassigned
to the next Revision in the model and the specified Revision will be deleted from
the model.  The operation can only be performed if both the specified Revision and the
next one are unissued.
document:
The Document containing the Revisions.
revisionId:
The Revision that should have its clouds and tags associated with the next Revision.
Returns:
The ids of all RevisionClouds that were reassigned to the next Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
revisionId cannot be combined with the next Revision because either revisionId is
the last Revision or the next Revision has already been issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Revision.CombineWithPrevious(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Combines the specified Revision with the previous Revision.
Remarks:
All RevisionClouds and tags associated with the specified Revision will be reassigned
to the previous Revision in the model and the specified Revision will be deleted from
the model.  The operation can only be performed if both the specified Revision and the
previous one are unissued.
document:
The Document containing the Revisions.
revisionId:
The Revision that should have its clouds and tags associated with the previous Revision.
Returns:
The ids of all RevisionClouds that were reassigned to the previous Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
revisionId cannot be combined with the previous Revision because either revisionId is
the first Revision or the previous Revision has already been issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Revision.ReorderRevisionSequence(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Reorders the sequence of Revisions in the project.
Remarks:
This method allows the caller to change the sequence of the Revisions within the project by specifying the
new sequence.  The specified sequence must include every Revision in the project exactly once.
Note that changing the sequence of Revisions can change the SequenceNumber and RevisionNumber
of Revisions that have already been issued.
document:
The document in which the Revision sequence should be reordered.
newSequence:
The new sequence of Revisions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSequence does not contain every Revision exactly once.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Revision.Create(Autodesk.Revit.DB.Document)
Creates a new Revision in the project.
Remarks:
The new Revision will be added at the end of the sequence of existing Revisions.
document:
The document of the new Revision.
Returns:
The newly created Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Revision.GetAllRevisionIds(Autodesk.Revit.DB.Document)
Returns the ids of all Revisions in the project ordered by sequence number.
document:
The document containing the Revisions.
Returns:
The ids of all the Revisions in the document ordered by sequence number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Revision.RevisionNumberingSequenceId
The id of the revision numbering sequence which controls this revision's numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: revisionNumberingSequenceId doesn't represent a RevisionNumberingSequence element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2022

Autodesk.Revit.DB.Revision.RevisionDate
The date of this Revision.
Remarks:
The Revision date is an arbitrary String and can be blank.  Revit will not
attempt to interpret it as an actual date.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.IssuedBy
Indicates who has issued or will issue this Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.IssuedTo
Indicates to whom this Revision was or will be issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.Description
The description of this Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015